// Напишите программу, которая принимает на вход 
// два числа и выдаёт, какое больше, а какое меньше. 

// Task 2

// Console.WriteLine("Введите первое число ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число ");
// int b = Convert.ToInt32(Console.ReadLine());
// if (a > b)
//     Console.WriteLine($"Большее число: {a}, меньшее число: {b}");
// else
// {
//     Console.WriteLine($"Большее число: {b}, меньшее число: {a}");
// }    







 // Напишите программу, которая принимает на вход три
 // числа и выдаёт максимальное из этих чисел.
 
 // Task 4

// Console.WriteLine("Введите первое число ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число ");
// int b = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите третье число ");
// int c = Convert.ToInt32(Console.ReadLine());
// int max = a;
// if (max < b) max = b;
// if (max < c) max = c;
// Console.WriteLine("Максимальное из этих чисел = " + max);