// Напишите программу, которая принимает на вход 
// два числа и выдаёт, какое больше, а какое меньше. 

// Task 2

// Console.WriteLine("Введите первое число ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число ");
// int b = Convert.ToInt32(Console.ReadLine());
// if (a > b)
//     Console.WriteLine($"Большее число: {a}, меньшее число: {b}");
// else
// {
//     Console.WriteLine($"Большее число: {b}, меньшее число: {a}");
// }    